app/controllers/concerts_controller.rb

  def index

    @concerts = Concert.order("created_at DESC").page(params[:page]).per(3)
---
SELECT "concerts".* FROM "concerts" ORDER BY created_at DESC
SELECT COUNT(*) FROM "concerts"

  def indexforuser
    @concerts = Concert.where("user_id = #{params[:id]}").page(params[:page]).per(3)
---
SELECT COUNT(*) FROM "concerts" WHERE (user_id = 1)

  def show
    @concert = Concert.find(params[:id])
---
SELECT "concerts".* FROM "concerts" WHERE "concerts"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @concert = Concert.new(params[:concert])

    respond_to do |format|
      if @concert.save
---
INSERT INTO "concerts" ("created_at", "date", "full_desc", "name_art", "poster_content_type", "poster_file_name", "poster_file_size", "poster_updated_at", "price", "song", "time_dur", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def edit
    @concert = Concert.find(params[:id])
---
SELECT "concerts".* FROM "concerts" WHERE "concerts"."id" = $1 LIMIT 1  [["id", "1"]]