app/controllers/users_controller.rb

  def follow
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]

  def unfollow
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]